In [2]:
import pandas as pd
df=pd.read_csv("globalAirQuality.csv")
print(df)

df.describe()

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
1      2025-11-04 19:25:17.554219      US  New York    40.713    -74.006
2      2025-11-04 20:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
4      2025-11-04 22:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542
17998  2025-11-19 16:25:17.554219      CH    Zurich    47.377      8.542
17999  2025-11-19 17:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
1      32.083   63.043  36.120  4.021  43.536  1.075   90        5.838
2      42.250   82.553  26.935  9.538  23.320  0.977   84       31.833
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
4      21.083   66.423  38.997  6.919  45.615  1.085   97       13.632
...       ...      ...     ...    ...     ...    ...  ...          ...
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951
17998  40.722   95.152  32.957  5.524  53.193  0.868   95       24.042
17999  25.830   30.411  35.317  4.336  66.246  0.848   88        8.529

       humidity  wind_speed
0        70.168       3.725
1        80.088       8.969
2        62.783       9.650
3        89.153       8.956
4        76.499       4.017
...         ...         ...
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660
17998    31.880       2.642
17999    59.104       4.403

[18000 rows x 15 columns]

,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
count,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000
mean,23.065980,37.655560,40.369131,70.152228,32.055176,6.035508,48.065100,0.800595,104.645556,21.510251,57.714351,5.283910
std,26.156536,78.600701,17.647450,24.999440,13.820680,2.454790,14.950849,0.250254,25.616070,9.509444,18.844908,2.741712
min,-37.814000,-123.121000,0.025000,0.061000,0.013000,0.003000,0.114000,0.000000,16.000000,5.000000,25.002000,0.500000
25%,12.972000,2.352000,27.904500,53.125500,22.362500,4.360750,38.028500,0.633000,87.000000,13.357750,41.320000,2.937000
50%,29.232000,42.146000,40.286500,69.961000,32.019500,6.026000,48.142000,0.800500,103.000000,21.455500,57.847000,5.297000
75%,41.008000,103.820000,52.436250,87.256500,41.364250,7.715250,58.258500,0.969000,121.000000,29.688250,74.234750,7.662000
max,60.170000,174.763000,115.683000,161.810000,90.019000,16.559000,103.016000,1.832000,231.000000,37.998000,89.997000,9.999000

In [3]:
#selecting data columns wise

# print(df["city"])
# print(df["aqi"])
print(df[["aqi","city"]])

       aqi      city
0      108  New York
1       90  New York
2       84  New York
3      158  New York
4       97  New York
...    ...       ...
17995  103    Zurich
17996  105    Zurich
17997  122    Zurich
17998   95    Zurich
17999   88    Zurich

[18000 rows x 2 columns]

In [4]:
#select rows-label based and index based

# print(df.loc[0])
# print(df.loc[0:3])# ending index is inluded with loc

df.iloc[0:3] # does not incluse last index

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650

In [5]:
# row and col based selection

# df.loc[0, "aqi"]
df.loc[0:4, ["aqi",'city']]

# df.iloc[0:4, ["aqi",'city']]# it will give error because iloc require only numerical values not string-we pass only numerical values into iloc

df.iloc[0:4,[2,3]]

       city  latitude
0  New York    40.713
1  New York    40.713
2  New York    40.713
3  New York    40.713

In [6]:
# aselect single scalar value

print(df.at[0,"city"])# return view not copy of data
print(df.iat[0,2])

# to create copy

cities=df["city"].copy()
cities[0]="Mumbai"
print(cities)

New York
New York
0          Mumbai
1        New York
2        New York
3        New York
4        New York
           ...
17995      Zurich
17996      Zurich
17997      Zurich
17998      Zurich
17999      Zurich
Name: city, Length: 18000, dtype: object

In [ ]:
#Filtering of data

# Aqi > 100

# df[df["aqi"]>100]
df[(df["aqi"]>100) & (df["temperature"]>30)]


# chaining
df[df["aqi"]>100][["city","aqi"]]

           city  aqi
0      New York  108
3      New York  158
6      New York  155
7      New York  115
8      New York  121
...         ...  ...
17991    Zurich  104
17993    Zurich  153
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122

[9721 rows x 2 columns]

In [ ]:
aqi_data=df[(df["aqi"]>100) & (df["temperature"]>30)]

# print(aqi_data)

aqi_data.iloc[0]# with index
aqi_data.loc[6] # with label 6

timestamp      2025-11-05 00:25:17.554219
country                                US
city                             New York
latitude                           40.713
longitude                         -74.006
pm25                                77.69
pm10                               65.198
no2                                20.302
so2                                 7.641
o3                                 62.687
co                                  0.734
aqi                                   155
temperature                        36.729
humidity                           47.651
wind_speed                          4.542
Name: 6, dtype: object

Queru Method

Query return copy not view

In [20]:
df.query("aqi>100") # we can pass a string like sql query

df.query("aqi>100 & temperature>30")[["city","aqi"]]

# If want to use any variable insire query method we can use @ for reference

val=100
df.query("aqi>@val")[["city","temperature"]]

           city  temperature
0      New York       18.504
3      New York       23.140
6      New York       36.729
7      New York       37.891
8      New York       24.092
...         ...          ...
17991    Zurich       32.556
17993    Zurich       20.437
17995    Zurich        7.079
17996    Zurich       28.734
17997    Zurich       21.951

[9721 rows x 2 columns]